;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! async)

(package! exec-path-from-shell)

(package! hc-zenburn-theme)
(package! spacemacs-theme)
(package! color-theme-sanityinc-tomorrow-theme)
(package! ample-theme)
(package! sublime-themes)
(package! darktooth-theme)
(package! jazz-theme)
(package! subatomic-theme)
(package! badwolf-theme)
(package! vscdark-theme)
